1.

In [141]:
import numpy as np
import pandas as pd

In [142]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

ser_list = pd.Series(mylist)
ser_arr = pd.Series(myarr)
ser_dict = pd.Series(mydict)

2.

In [143]:
df = ser_dict.reset_index()
df.columns = ['index', 'value']

3.

In [144]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

df = pd.concat([ser1, ser2], axis=1)
df.columns = ['char', 'number']

4.

In [145]:
ser1 = pd.Series([1,2,3,4,5])
ser2 = pd.Series([4,5,6,7,8])

In [146]:
result1 = ser1[~ser1.isin(ser2)]

In [147]:
result2 = pd.Series(np.setxor1d(ser1, ser2))

5.

In [148]:
ser = pd.Series(np.random.normal(10, 5, 25))

In [149]:
ser.min()
ser.quantile(0.25)
ser.median()
ser.quantile(0.75)
ser.max()

np.float64(20.802623938848235)

6.

In [150]:
ser = pd.Series(np.take(list('abcdefg'), np.random.randint(7, size=30)))

In [151]:
ser.value_counts()

c    8
f    5
g    5
b    4
e    3
a    3
d    2
Name: count, dtype: int64

7.

In [152]:
np.random.seed(100)
ser = pd.Series(np.random.randint(1, 5, 12))

top2 = ser.value_counts().nlargest(2).index
ser[~ser.isin(top2)] = 'Other'

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_21908\3339976724.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Other' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ser[~ser.isin(top2)] = 'Other'

8.

In [153]:
ser = pd.Series(np.random.random(20))
labels = [f'D{i}' for i in range(1,11)]
result = pd.qcut(ser, 10, labels=labels)

9.

In [154]:
ser = pd.Series(np.random.randint(1, 10, 35))

In [155]:
df = pd.DataFrame(ser.values.reshape(7,5))

10.

In [156]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser[ser % 3 == 0]

0    6
4    3
6    3
dtype: int32

11.

In [157]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

ser.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

12.

In [158]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

df_col = pd.concat([ser1, ser2], axis=1)
df_row = pd.concat([ser1, ser2], axis=0)

13.

In [159]:
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

positions = [ser1[ser1 == i].index[0] for i in ser2]

14.

In [160]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

mse = ((truth - pred) ** 2).mean()

15.

In [161]:
ser = pd.Series(['how','to','kick','ass?'])
ser.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

16.

In [162]:
ser = pd.Series([1,3,6,10,15,21,27,35])
ser.diff()

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

17.

In [163]:
ser = pd.Series(['01 Jan 2010','02-02-2011','20120303','2013/04/04',
                 '2014-05-05','2015-06-06T12:20'])

# parse mixed date formats; use dayfirst for ambiguous day/month and coerce errors to avoid raising
ts = pd.to_datetime(ser, format='mixed', dayfirst=True, errors='coerce')

18.

In [164]:
emails = pd.Series([
    'buying books at amazon.com',
    'rameses@egypt.com',
    'matt@t.co',
    'narendra@modi.com'
])

pattern = r'[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,4}'
emails[emails.str.contains(pattern)]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

19.

In [165]:
fruit = pd.Series(np.random.choice(['apple','banana','carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

weighted_mean = weights.groupby(fruit).sum() / fruit.value_counts()

20.

In [166]:
import pandas as pd

data = {
    'Team': ['Germany','England','Italy','Russia'],
    'Goals': [10,5,6,2],
    'Yellow Cards': [1,3,2,1],
    'Red Cards': [0,0,0,0],
    'Shooting Accuracy': ['15%','12%','14%','10%']
}

pd.DataFrame(data).to_csv('euro12.csv', index=False)

In [167]:
euro12 = pd.read_csv('euro12.csv')

In [168]:
euro12.shape

(4, 5)

In [169]:
euro12.columns
euro12.dtypes

Team                 object
Goals                 int64
Yellow Cards          int64
Red Cards             int64
Shooting Accuracy    object
dtype: object

In [170]:
euro12['Goals']

0    10
1     5
2     6
3     2
Name: Goals, dtype: int64

In [171]:
euro12['Team'].nunique()

4

In [172]:
cards = euro12[['Team','Yellow Cards','Red Cards']]

In [173]:
cards.sort_values(by=['Red Cards','Yellow Cards'], ascending=False)

euro12[euro12['Goals'] > 6]

      Team  Goals  Yellow Cards  Red Cards Shooting Accuracy
0  Germany     10             1          0               15%

In [174]:
euro12[euro12['Team'].str.startswith('G')]

      Team  Goals  Yellow Cards  Red Cards Shooting Accuracy
0  Germany     10             1          0               15%

In [175]:
euro12.iloc[:, :7]

      Team  Goals  Yellow Cards  Red Cards Shooting Accuracy
0  Germany     10             1          0               15%
1  England      5             3          0               12%
2    Italy      6             2          0               14%
3   Russia      2             1          0               10%

In [176]:
euro12.iloc[:, :-3]

      Team  Goals
0  Germany     10
1  England      5
2    Italy      6
3   Russia      2

In [177]:
euro12[['Team','Goals','Shooting Accuracy']]

      Team  Goals Shooting Accuracy
0  Germany     10               15%
1  England      5               12%
2    Italy      6               14%
3   Russia      2               10%

In [178]:
euro12.loc[euro12['Team'].isin(['England','Italy','Russia']),
           ['Team','Shooting Accuracy']]

      Team Shooting Accuracy
1  England               12%
2    Italy               14%
3   Russia               10%

21

In [179]:
data = {
    'country':['USA','France','Germany'],
    'beer_servings':[249,127,346],
    'spirit_servings':[158,151,117],
    'wine_servings':[84,370,175],
    'continent':['NA','EU','EU']
}

pd.DataFrame(data).to_csv('drinks.csv', index=False)

In [180]:
drinks = pd.read_csv('drinks.csv', index_col='country')

In [181]:
drinks.dtypes
drinks.shape
drinks.columns

Index(['beer_servings', 'spirit_servings', 'wine_servings', 'continent'], dtype='object')

In [182]:
drinks.head()
drinks.tail()

         beer_servings  spirit_servings  wine_servings continent
country
USA                249              158             84       NaN
France             127              151            370        EU
Germany            346              117            175        EU

In [183]:
drinks.groupby('continent').mean()

           beer_servings  spirit_servings  wine_servings
continent
EU                 236.5            134.0          272.5

In [184]:
drinks.groupby('continent').describe()

          beer_servings                                                   \
                  count   mean         std    min     25%    50%     75%
continent
EU                  2.0  236.5  154.856385  127.0  181.75  236.5  291.25

                 spirit_servings         ...               wine_servings  \
             max           count   mean  ...    75%    max         count
continent                                ...
EU         346.0             2.0  134.0  ...  142.5  151.0           2.0


            mean         std    min     25%    50%     75%    max
continent
EU         272.5  137.885822  175.0  223.75  272.5  321.25  370.0

[1 rows x 24 columns]

In [185]:
drinks.sort_values(by='spirit_servings')

         beer_servings  spirit_servings  wine_servings continent
country
Germany            346              117            175        EU
France             127              151            370        EU
USA                249              158             84       NaN

In [186]:
drinks['beer_servings'].nlargest(5)
drinks['beer_servings'].nsmallest(5)

country
France     127
USA        249
Germany    346
Name: beer_servings, dtype: int64

22.

In [187]:
stocks1 = pd.DataFrame({
    'symbol':['AAPL','GOOG'],
    'open':[100,200],
    'close':[110,190],
    'high':[115,210],
    'low':[95,180],
    'parsed_time':['2020-01-01','2020-01-02']
})

stocks1.to_csv('stocks1.csv', index=False)
stocks1.to_csv('stocks2.csv', index=False)

companies = pd.DataFrame({
    'symbol':['AAPL','GOOG'],
    'name':['Apple','Google']
})

companies.to_csv('companies.csv', index=False)

In [188]:
stocks1 = pd.read_csv('stocks1.csv')
stocks2 = pd.read_csv('stocks2.csv')
companies = pd.read_csv('companies.csv')

In [189]:
stocks1.fillna(stocks1.max(), inplace=True)
stocks2.fillna(stocks2.min(), inplace=True)

In [190]:
stocks = pd.concat([stocks1, stocks2])

In [191]:
df = stocks.merge(companies, on='symbol')

In [192]:
df[['open','high','low','close']].mean()
df['close'].max()
df['close'].min()

np.int64(110)

In [193]:
df['parsed_time'] = pd.to_datetime(df['parsed_time'])

In [194]:
df['result'] = np.where(df['close'] > df['open'], 'up', 'down')